Repository: pongy20/FIleSynchro
Catalog: DirectoryCopy/Translations/*.lproj/Localizable.strings
Languages: ar, de, es, fr, it, zh_hans

# app_title
source: Directory Synchronizer
ar: مزامنة المجلدات
de: Verzeichnissynchronisierer
es: Sincronizador de Directorios
fr: Synchroniseur de Dossiers
it: Sincronizzatore di Cartelle
zh_hans: 目录同步器

# choose_source_button
source: Choose a source directory (A)
ar: اختر المجلد المصدر (A)
de: Wähle ein Quellverzeichnis (A)
es: Elige un directorio de origen (A)
fr: Choisissez un dossier source (A)
it: Scegli una cartella sorgente (A)
zh_hans: 选择源目录 (A)

# source_text
source: Source (A):
ar: المصدر (A):
de: Quelle (A):
es: Fuente (A):
it: Fonte (A):
zh_hans: 源 (A):

# not_choosen_text
source: not chosen
ar: لم يتم الاختيار
de: nicht ausgewählt
es: no elegido
fr: non choisi
it: non selezionato
zh_hans: 未选择

# choose_dest_button
source: Choose a target directory (B)
ar: اختر مجلد الوجهة (B)
de: Wähle ein Zielverzeichnis (B)
es: Elige un directorio de destino (B)
fr: Choisissez un dossier de destination (B)
it: Scegli una cartella di destinazione (B)
zh_hans: 选择目标目录 (B)

# dest_text
source: Target (B):
ar: الوجهة (B):
de: Ziel (B):
es: Destino (B):
fr: Destination (B):
it: Destinazione (B):
zh_hans: 目标 (B):

# should_delete_toggle
source: Delete files present in the target directory but not in the source directory
ar: حذف الملفات الموجودة في مجلد الوجهة ولكن ليست في المجلد المصدر
de: Dateien im Zielverzeichnis, die nicht im Quellverzeichnis vorhanden sind, löschen
es: Eliminar los archivos que se encuentran en el directorio de destino pero no en el de origen
fr: Supprimer les fichiers présents dans le dossier de destination mais pas dans le dossier source
it: Elimina i file presenti nella cartella di destinazione ma non nella cartella sorgente
zh_hans: 删除在目标目录中但不在源目录中的文件

# check_existing_files_toggle
source: Check files for changes (recommended)
ar: تحقق من التغييرات في الملفات الموجودة (موصى به)
de: Bestehende Dateien auf Änderungen prüfen (empfohlen)
es: Comprobar si hay cambios en los archivos existentes (recomendado)
fr: Vérifiez les fichiers existants pour les changements (recommandé)
it: Controlla le modifiche nei file esistenti (consigliato)
zh_hans: 检查现有文件的更改 (推荐)

# check_method_picker
source: Checking method:
ar: طريقة التحقق:
de: Prüfmethode:
es: Método de comprobación:
fr: Méthode de vérification:
it: Metodo di controllo:
zh_hans: 检查方法:

# sha256_text
source: SHA256 (recommended)
ar: SHA256 (موصى به)
de: SHA256 (empfohlen)
es: SHA256 (recomendado)
fr: SHA256 (recommandé)
it: SHA256 (consigliato)
zh_hans: SHA256 (推荐)

# direct_comparism_text
source: Direct file comparison
ar: مقارنة الملفات المباشرة
de: Direkter Dateivergleich (nicht empfohlen)
es: Comparación directa de archivos
fr: Comparaison directe de fichiers
it: Confronto diretto dei file
zh_hans: 直接文件比较

# check_method_hint_text
source: Note: The SHA256 method provides a significantly faster synchronization but does not ensure 100% accuracy. The direct file comparison gives you the ability to ensure 100% whether the content of the file contains changes. The chance that this change will not be recognized with SHA256 is lower than 0.00000001%!
ar: ملاحظة: الطريقة SHA256 توفر مزامنة أسرع بكثير ولكن لا تضمن الدقة بنسبة 100%. المقارنة المباشرة للملفات تتيح التحقق بنسبة 100% إذا تم تغيير محتوى الملف. الفرصة التي لن يتم اكتشاف هذا التغيير بواسطة SHA256 هي أقل من 0,00000001%!
de: Hinweis: Für eine optimale genauigkeit wird die SHA-256 Methode empfohlen! Diese nimmt allerdings etwas mehr an Rechenleistung und Zeit in Anspruch. Wenn die Synchronisation schneller gehen soll, kann der Metadatenvergleich ausgewählt werden. Bei diesem Vergleich kann es zu Ungenauigkeiten kommen. Der direkte Dateivergleich ist langsam und nimmt viel Arbeitsspeicher in Anspruch. Diese Methode wird nicht empfohlen!
es: Nota: El método SHA256 proporciona una sincronización mucho más rápida, pero no garantiza una precisión del 100%. La comparación directa de archivos permite verificar con un 100% de certeza si el contenido del archivo ha cambiado. La posibilidad de que este cambio no sea detectado por SHA256 es menor al 0,00000001%!
fr: Note: La méthode SHA256 assure une synchronisation beaucoup plus rapide mais ne garantit pas une précision de 100%. La comparaison directe de fichiers permet de vérifier avec 100% de certitude si le contenu du fichier a été modifié. La chance que cette modification ne soit pas détectée par SHA256 est inférieure à 0,00000001%!
it: Nota: Il metodo SHA256 assicura una sincronizzazione molto più veloce ma non garantisce una precisione del 100%. Il confronto diretto dei file permette di verificare con una certezza del 100% se il contenuto del file è stato modificato. La probabilità che questa modifica non venga rilevata con SHA256 è inferiore allo 0,00000001%!
zh_hans: 注意：SHA256 方法可以大大加快同步速度，但不能保证100%的准确性。直接文件比较可以100%确定文件内容是否有更改。SHA256未能识别这种更改的概率低于0.00000001%！

# sync_button
source: Start synchronization
ar: ابدأ المزامنة
de: Synchronisation starten
es: Iniciar sincronización
fr: Démarrer la synchronisation
it: Avvia sincronizzazione
zh_hans: 开始同步

# no_directory_choosen_alert_title
source: Directories not chosen
ar: لم يتم اختيار المجلدات
de: Keine Verzeichnisse ausgewählt
es: No se seleccionaron directorios
fr: Aucun dossier sélectionné
it: Cartelle non selezionate
zh_hans: 目录未选择

# no_directory_choosen_alert_text
source: Please choose a source and target directory before starting the synchronization.
ar: الرجاء اختيار مجلد المصدر ومجلد الوجهة أولاً قبل بدء المزامنة.
de: Bitte wähle zuerst ein Quell- und Zielverzeichnis, bevor die Synchronisation gestartet wird.
es: Por favor, elija primero un directorio de origen y de destino antes de iniciar la sincronización.
fr: Veuillez d'abord choisir un dossier source et de destination avant de commencer la synchronisation.
it: Per favore, scegli prima una cartella sorgente e una cartella di destinazione prima di iniziare la sincronizzazione.
zh_hans: 请先选择一个源目录和一个目标目录，然后再开始同步。

# success_alert_title
source: Success!
ar: النجاح!
de: Auswertung:
es: ¡Éxito!
fr: Succès!
it: Successo!
zh_hans: 成功！

# success_alert_text
source: The synchronization has been successfully carried out!
ar: تمت المزامنة بنجاح!
de: Die Synchronisation wurde erfolgreich durchgeführt!
es: ¡La sincronización se realizó con éxito!
fr: La synchronisation a été effectuée avec succès!
it: La sincronizzazione è stata completata con successo!
zh_hans: 同步已成功完成！

# synchronization_running_progress
source: Directories are being synchronized...
ar: جاري مزامنة المجلدات...
de: Die Verzeichnisse werden synchronisiert...
es: Sincronizando directorios...
fr: Synchronisation des dossiers en cours...
it: Sincronizzazione delle cartelle in corso...
zh_hans: 正在同步目录...

# stats_files_in_source
source: Files in source directory: %d
ar: الملفات في الدليل المصدر: %d
de: Dateien im Quellverzeichnis: %d
es: Archivos en el directorio fuente: %d
fr: Fichiers dans le répertoire source : %d
it: File nella cartella di origine: %d
zh_hans: 源目录中的文件数：%d

# stats_directories_in_source
source: Directories in source directory: %d
ar: الدلائل في الدليل المصدر: %d
de: Verzeichnisse im Quellverzeichnis: %d
es: Directorios en el directorio fuente: %d
fr: Répertoires dans le répertoire source : %d
it: Cartelle nella cartella di origine: %d
zh_hans: 源目录中的目录数：%d

# stats_copied_files
source: Copied files: %d
ar: الملفات المنسوخة: %d
de: Zu kopierende Dateien: %d
es: Archivos copiados: %d
fr: Fichiers copiés : %d
it: File copiati: %d
zh_hans: 已复制的文件数：%d

# stats_overwritten_files
source: Overwritten files: %d
ar: الملفات المكتوبة فوق: %d
de: Zu überschreibende Dateien: %d
es: Archivos sobrescritos: %d
fr: Fichiers écrasés : %d
it: File sovrascritti: %d
zh_hans: 已覆盖的文件数：%d

# stats_deleted_files_in_destination
source: Deleted files in destination directory: %d
ar: الملفات المحذوفة في الدليل الهدف: %d
de: Zu löschende Dateien im Zielverzeichnis: %d
es: Archivos eliminados en el directorio de destino: %d
fr: Fichiers supprimés dans le répertoire de destination : %d
it: File cancellati nella cartella di destinazione: %d
zh_hans: 目标目录中已删除的文件数：%d

# stats_duration
source: Duration: %.2f seconds
ar: المدة: %.2f ثوانٍ
de: Dauer der Analyse: %.2f Sekunden
es: Duración: %.2f segundos
fr: Durée : %.2f secondes
it: Durata: %.2f secondi
zh_hans: 持续时间：%.2f秒
